In [1]:
import pandas as pd
objs = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
objs

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
#reindex()實體方法->重新改變索引
#reindex()重新排序索引或保留想要的索引
objs.reindex(['a', 'b', 'c', 'd'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [8]:
objs.reindex(['a', 'b', 'c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [11]:
#DataFrame可以使用reindex()改變列或欄的排序或保留想要的索引
import numpy as np
#np.arange(9).reshape(3,3)使用ndarray來建立DataFrame
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [12]:
frame.reindex(['a', 'd', 'c'])

   台北  台中  高雄
a   0   1   2
d   6   7   8
c   3   4   5

In [13]:
frame.reindex(['a', 'c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [15]:
#reindex(columns=[])改變欄位的索引
frame.reindex(columns=['台北', '高雄', '台中'])

   台北  高雄  台中
a   0   2   1
c   3   5   4
d   6   8   7

In [16]:
#reindex(columns=[])保留欄位的索引
frame.reindex(columns=['台北', '台中'])

   台北  台中
a   0   1
c   3   4
d   6   7

In [17]:
#drop()實體方法 --> 預設移除列,drop(,axis=1)
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [18]:
data.drop(['台北', '台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [20]:
data.drop(['one', 'two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [22]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [24]:
data[['one', 'two', 'three']]

    one  two  three
台北    0    1      2
台中    4    5      6
台南    8    9     10
高雄   12   13     14

In [25]:
data[:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [26]:
data[:1]

    one  two  three  four
台北    0    1      2     3

In [27]:
data[-2:]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [31]:
#bs = pd.Series([True, False, False, False]) 不是任意的Series就可以過濾
#data[bs]
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [34]:
filterData=data['four'] > 10
data[filterData]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [39]:
data < 10

      one    two  three   four
台北   True   True   True   True
台中   True   True   True   True
台南   True   True  False  False
高雄  False  False  False  False

In [40]:
data[data < 10] = 0
data

    one  two  three  four
台北    0    0      0     0
台中    0    0      0     0
台南    0    0     10    11
高雄   12   13     14    15

In [41]:
#實體屬性loc[],iloc[]
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [42]:
data.loc['台北',['two', 'three']]

two      1
three    2
Name: 台北, dtype: int64

In [44]:
data.iloc[0,[1, 2]]

two      1
three    2
Name: 台北, dtype: int64

In [45]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [46]:
data.loc['台南']

one       8
two       9
three    10
four     11
Name: 台南, dtype: int64

In [47]:
import pandas as pd
dataFrame = pd.read_csv('各鄉鎮市區人口密度.csv')
dataFrame

,statistic_yyy,site_id,people_total,area,population_density
0,統計年,區域別,年底人口數,土地面積,人口密度
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [49]:
dataFrame.dtypes

statistic_yyy         object
site_id               object
people_total          object
area                  object
population_density    object
dtype: object

In [50]:
dataFrame.shape

(376, 5)